# DocumentClosedEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentClosedEventArgs Class
Members See Also
---
The event arguments used by the DocumentClosed event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public class DocumentClosedEventArgs : RevitAPIPostEventArgs
```

Visual Basic
---
```text
Public Class DocumentClosedEventArgs _
	Inherits RevitAPIPostEventArgs
```

Visual C++
---
```text
public ref class DocumentClosedEventArgs : public RevitAPIPostEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..DocumentClosedEventArgs
# See Also
DocumentClosedEventArgs Members
Autodesk.Revit.DB.Events Namespace